### Pandas Exercises

Write a Pandas program to create and display a one-dimensional array-like object containing an array of data.

In [8]:
import pandas as pd
import numpy as np

ds = pd.Series([2,4,6,8,10])
print(ds)

0     2
1     4
2     6
3     8
4    10
dtype: int64

Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

In [10]:
test_data = {'name':['Mojie','Patchi','Fluffy','Lucas','Jacob'],
            'color': ['Brown','White','Black','Brown',np.nan],
            'year': [3,1,2,3,3]}
labels = np.arange(0,5,1)
test_data = pd.DataFrame(test_data,labels)
test_data

     name  color  year
0   Mojie  Brown     3
1  Patchi  White     1
2  Fluffy  Black     2
3   Lucas  Brown     3
4   Jacob    NaN     3

Write a Pandas program to add some data to an existing Series.

In [57]:
even_numbers = pd.Series([2,4,6,8,10])
new_even_numbers = pd.concat([even_numbers, pd.Series([12,14])], ignore_index=False)
new_even_numbers

0     2
1     4
2     6
3     8
4    10
0    12
1    14
dtype: int64

Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

In [59]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts' : [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data , index=labels)
df
df.loc[(df.attempts>2)]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

Write a Pandas program to add some data to an existing Series.

In [66]:
#if we're making a series X and Y become rows
import pandas as pd
df = pd.Series({'X':[1,2,3],'Y':[4,5,6]})
#if we're making a dataframe, X and Y become columns
df = pd.DataFrame({'X':[1,2,3],'Y':[4,5,6]})
df

   X  Y
0  1  4
1  2  5
2  3  6